#include <ansi.h>
inherit ROOM;

string look_duilian();

void create()
{
        set("short", "ÄÏÌìÃÅ");
        set("long", @LONG
µ½ÁËÄÏÌìÃÅ£¬²ÅÄÜÍûµ½ºâÉ½µÚÒ»µÄ×£ÈÚ·å¡£ÄÏÌìÃÅÊÇ»¨¸ÚÑÒ×ö³É
µÄÊ¯±®·»£¬ÖÐÃÅïÔÓÐ¡¸[1£»36m ÄÏÌìÃÅ [2£»37£»0m¡¹Èý×Öºá¶î£¬×óÓÒ¶þÃÅµÄÃÅé¹ÉÏ£¬·Ö
±ð¿ÌÓÐ¡¸[1£»37mÐÐÔÆ[2£»37£»0m¡¹ºÍ¡¸[1£»37mÊ©Óê[2£»37£»0m¡¹¶þ×Ö¡£éºÁª(lian)ÆÆÂª£¬ÏÔ¼ûËêÔÂÒÑ¾Ã¡£
LONG );
        set("item_desc",([
                "lian" : (: look_duilian :),
        ]));
        set("exits", ([
                "eastup"    : __DIR__"liuyunping",
                "northeast" : __DIR__"shiziyan",
                "northwest" : __DIR__"shanlu14",
                "southeast" : __DIR__"denggaotai",
                "southwest" : __DIR__"shanlu13",
        ]));
 
        set("objects", ([
                __DIR__"npc/dizi1" :  4,
        ]));

        set("outdoors", "henshan");
        set("coor/x", -50);
	set("coor/y", 70);
	set("coor/z", 20);
	setup();
}

string look_duilian()
{
        return
        HIC "\n"
        "\t¡ù¡ù¡ù¡ù¡ù¡ù¡ù        ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n"
        "\t¡ù¡ù¡ù¡ù¡ù¡ù¡ù        ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n"
        "\t¡ù¡ù      ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" NOR + WHT "¡¡ÃÅ¡¡" HIC "¡ù¡ù        ¡ù¡ù" NOR + WHT "  Â·  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" NOR + WHT "¡¡¿É¡¡" HIC "¡ù¡ù        ¡ù¡ù" NOR + WHT "  ³Ð  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" NOR + WHT "¡¡Í¨¡¡" HIC "¡ù¡ù        ¡ù¡ù" NOR + WHT "  ¾ø  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" NOR + WHT "¡¡Ìì¡¡" HIC "¡ù¡ù        ¡ù¡ù" NOR + WHT "  ¶¥  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" HIW "¡¡Ñö¡¡" HIC "¡ù¡ù        ¡ù¡ù" HIW "  ¸©  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" HIW "¡¡¹Û¡¡" HIC "¡ù¡ù        ¡ù¡ù" HIW "  î«  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" HIW "¡¡±Ì¡¡" HIC "¡ù¡ù        ¡ù¡ù" HIW "  ´ä  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" HIW "¡¡Âä¡¡" HIC "¡ù¡ù        ¡ù¡ù" HIW "  Î¢  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" HIW "¡¡ÐÇ¡¡" HIC "¡ù¡ù        ¡ù¡ù" HIW "  ÂÍ  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" HIW "¡¡³½¡¡" HIC "¡ù¡ù        ¡ù¡ù" HIW "  Óì  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù¡¡ ¡¡ ¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù" HIW "¡¡½ü¡¡" HIC "¡ù¡ù        ¡ù¡ù" HIW "  µÍ  " HIC "¡ù¡ù\n"
        "\t¡ù¡ù    ¡¡¡ù¡ù        ¡ù¡ù      ¡ù¡ù\n"
        "\t¡ù¡ù¡ù¡ù¡ù¡ù¡ù        ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n"
        "\t¡ù¡ù¡ù¡ù¡ù¡ù¡ù        ¡ù¡ù¡ù¡ù¡ù¡ù¡ù\n\n" NOR;
}
